{"class_name": "Model", "config": {"output_layers": [["sequential_1", 1, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 150, 150, 3]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block1_conv1", "padding": "same", "kernel_constraint": null, "filters": 64, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block1_conv2", "padding": "same", "kernel_constraint": null, "filters": 64, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block1_pool", "padding": "valid"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block2_conv1", "padding": "same", "kernel_constraint": null, "filters": 128, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block2_conv2", "padding": "same", "kernel_constraint": null, "filters": 128, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block2_pool", "padding": "valid"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block3_conv1", "padding": "same", "kernel_constraint": null, "filters": 256, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block3_conv2", "padding": "same", "kernel_constraint": null, "filters": 256, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block3_conv3", "padding": "same", "kernel_constraint": null, "filters": 256, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block3_pool", "padding": "valid"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block4_conv1", "padding": "same", "kernel_constraint": null, "filters": 512, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block4_conv2", "padding": "same", "kernel_constraint": null, "filters": 512, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block4_conv3", "padding": "same", "kernel_constraint": null, "filters": 512, "trainable": false, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block4_pool", "padding": "valid"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block5_conv1", "padding": "same", "kernel_constraint": null, "filters": 512, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block5_conv2", "padding": "same", "kernel_constraint": null, "filters": 512, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "block5_conv3", "padding": "same", "kernel_constraint": null, "filters": 512, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "block5_pool", "padding": "valid"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32", "batch_input_shape": [null, 4, 4, 512]}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "units": 256, "use_bias": true, "activation": "relu", "name": "dense_1", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "units": 3, "use_bias": true, "activation": "softmax", "name": "dense_2", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}], "name": "sequential_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.2.0"}